const balancedLiberalArtsRaw = '''
문학과문화|고사와성어의탐구|2|정영실|목 14:00-16:00
문학과문화|그리스로마신화의이해|2|미정|월 14:00-16:00
문학과문화|그리스로마신화의이해|2|미정|수 11:00-13:00
문학과문화|문학의이해|2|최지현|월 14:00-16:00
문학과문화|문학의이해|2|김지율|수 11:00-13:00
문학과문화|문학의이해|2|김소정|금 11:00-13:00
문학과문화|문학의이해|2|정미진|금 09:00-11:00
문학과문화|영상으로읽는영미문학|2|김미정|수 11:00-13:00
문학과문화|유라시아의민족과문화|2|정경택|화 14:00-16:00
문학과문화|유럽문화의이해|2|최재호|월 16:00-18:00
문학과문화|일본문화의이해|2|조은정|월 14:00-16:00
문학과문화|일본문화의이해|2|미정|수 09:00-11:00
문학과문화|일본문화의이해|2|강기철|수 16:00-18:00
문학과문화|일본문화의이해|2|이은주|화 11:00-13:00
문학과문화|일본문화의이해|2|전영희|월 11:00-13:00
문학과문화|저작권의이해|2|조미라|목 16:00-18:00
문학과문화|저작권의이해|2|조미라|월 16:00-18:00
문학과문화|프랑스문화와언어의이해|2|김미진|금 11:00-13:00
문학과문화|프랑스어권문화여행|2|김미진|금 14:00-16:00
문학과문화|한국의전통사상과민족문화|2|남윤덕|금 16:00-18:00
문학과문화|한자의이해|2|김혁|목 11:00-13:00
문학과문화|한자의이해|2|김계화|목 14:00-16:00
문학과문화|한자의이해|2|안승웅|화 16:00-18:00
문학과문화|사이언스픽션과진화적상상력|2|천현순|수 11:00-13:00
문학과문화|세계영화기행|3|강경화|월 16:00-18:00, 목 16:00-17:00
문학과문화|한류문화산업의이해|2|김원종|금 16:00-18:00
문학과문화|한국고전문학의현대적이해와감상|2|강경호|월 16:00-18:00
문학과문화|실무영어I|2|구승본|화 22:00-24:00
문학과문화|한국인의언어와문화|2|박성희|수 16:00-18:00
문학과문화|한국고전의이해|2|문정우|월 09:00-11:00
문학과문화|한국고전과콘텐츠활용|2|남기민|수 11:00-13:00
문학과문화|대중문화읽기|2|강은설|수 09:00-11:00
문학과문화|대중문화읽기|2|미정|월 11:00-13:00
문학과문화|대중문화읽기|2|모영화|금 09:00-11:00
문학과문화|대중문화읽기|2|정은주|금 16:00-18:00
문학과문화|대중문화읽기|2|미정|화 16:00-18:00
역사와철학|거울에비친유럽문명|2|박상욱|월 09:00-11:00
역사와철학|거울에비친유럽문명|2|박상욱|월 14:00-16:00
역사와철학|거울에비친유럽문명|2|박상욱|월 16:00-18:00
역사와철학|과학기술과철학|2|차봉석|목 14:00-16:00
역사와철학|과학기술과철학|2|차봉석|목 16:00-18:00
역사와철학|동아시아의고전이해|2|김덕환|월 14:00-16:00
역사와철학|동아시아의고전이해|2|최형섭|화 14:00-16:00
역사와철학|동아시아의고전이해|2|안승웅|화 11:00-13:00
역사와철학|동아시아의사상|2|구자익|목 14:00-16:00
역사와철학|사회윤리|2|김대군|화 09:00-11:00
역사와철학|생명의료윤리|2|이상형|목 11:00-13:00
역사와철학|서양미술의역사|2|미정|목 16:00-18:00
역사와철학|서양미술의역사|2|미정|금 16:00-18:00
역사와철학|예술과생활|2|하상협|화 09:00-11:00
역사와철학|인간과윤리|2|홍석영 외 4명|월 16:00-18:00
역사와철학|인도의신화와철학|2|안병도|화 11:00-13:00
역사와철학|일화로보는한국인물사|2|정두호|화 11:00-13:00
역사와철학|한국근현대사이해|2|김제정|수 14:00-16:00
역사와철학|한국근현대사이해|2|강호광|수 14:00-16:00
역사와철학|한국인의역사인식|2|윤경진|수 11:00-13:00
역사와철학|한국인의역사인식|2|나희라|목 11:00-13:00
역사와철학|한국사인물산책|2|오세현|목 09:00-11:00
역사와철학|한국사인물산책|2|오세현|목 14:00-16:00
역사와철학|이슈로보는중국|2|채경수|금 11:00-13:00
역사와철학|물품의세계사|2|정재훈|목 14:00-16:00
인간과사회|FTA의이해와활용|2|김권수|수 16:00-18:00
인간과사회|나의삶과지방자치|2|이성진|수 09:00-11:00
인간과사회|마음의문제|2|최지명|목 11:00-13:00
인간과사회|마음의문제|2|이유정|월 14:00-16:00
인간과사회|문화간소통과글로벌에티켓|2|천현순|목 11:00-13:00
인간과사회|문화간소통과글로벌에티켓|2|게르트 옌드라쉐크|월 11:00-13:00
인간과사회|범죄와인권|2|정도희|화 16:00-18:00
인간과사회|범죄와인권|2|정도희|목 16:00-18:00
인간과사회|범죄와인권|2|김두상|수 09:00-11:00
인간과사회|범죄와인권|2|김두상|목 09:00-11:00
인간과사회|범죄와인권|2|김두상|금 09:00-11:00
인간과사회|북한정치와사회|2|성현영|목 11:00-13:00
인간과사회|북한정치와사회|2|성현영|목 16:00-18:00
인간과사회|생활법률|2|이동임|월 11:00-13:00
인간과사회|생활법률|2|이동임|월 14:00-16:00
인간과사회|생활법률|2|이동임|수 09:00-11:00
인간과사회|생활법률|2|배명이|수 11:00-13:00
인간과사회|생활법률|2|배명이|목 09:00-11:00
인간과사회|생활법률|2|배명이|목 14:00-16:00
인간과사회|여성과사회|2|권수현|화 14:00-16:00
인간과사회|정치경제학의이해|2|정구현|수 11:00-13:00
인간과사회|직장과심리학|2|배병훈|화 14:00-16:00
인간과사회|직장과심리학|2|배병훈|화 16:00-18:00
인간과사회|한국경제의이해|2|김종주|금 09:00-11:00
인간과사회|경제학뒤집어보기|2|김윤식|화 11:00-13:00
인간과사회|20대를위한행복심리학|2|하재필|월 09:00-11:00
인간과사회|다문화교육의이해|2|송정애|월 16:00-18:00
인간과사회|심리학으로푸는스트레스|2|이미령|화 16:00-18:00
인간과사회|심리학으로푸는스트레스|2|이유정|월 11:00-13:00
인간과사회|인터넷윤리|2|장정아|월 14:00-16:00
인간과사회|평화사상과통일의길|2|성현영|금 14:00-16:00
인간과사회|GNU인성|2|이연희 외 4명|화 16:00-18:00
인간과사회|GNU인성|2|이종승 외 4명|화 16:00-18:00
인간과사회|GNU인성|2|김권수 외 3명|화 16:00-18:00
인간과사회|지구환경의위기와지속가능한미래|2|최기룡|화 11:00-13:00
인간과사회|법적용과법적사고의기초적이해|2|장우찬|수 09:00-11:00
인간과사회|영상콘텐츠기획의기초|2|곽은아|금 16:00-18:00
인간과사회|부란무엇인가|2|김윤식|화 16:00-18:00
인간과사회|디지털시대의욕망과나다움|2|김형석 외 3명|월 09:00-11:00
인간과사회|SDGs와인간|2|매튜젠킨스 외 3명|수 14:00-16:00
인간과사회|SDGs의이해와실제|2|김주현|화 14:00-16:00
인간과사회|유럽도시문화산책|2|이춘우|수 14:00-16:00
인간과사회|전쟁과국제질서|2|신영환|수 14:00-16:00
인간과사회|직장생활과윤리적리더십|2|성현영 외 1명|금 11:00-13:00
인간과사회|지속가능환경|2|기서진 외 1명|목 14:00-16:00
인간과사회|의사소통과인간관계심리학|2|이아라 외 1명|금 11:00-13:00
인간과사회|인간과전략|2|조성의|월 09:00-11:00
인간과사회|자연재해와맞서는사람들의이야기|2|최영환|월 16:00-18:00
인간과사회|시민의권리와사회|2|김소진|목 11:00-13:00
인간과사회|지속가능한기업의ESG|2|김현수 외 1명|목 16:00-18:00
생명과환경|생명과학|2|전지혜|화 14:00-16:00
생명과환경|생활과건강|2|최미진 외 2명|화 11:00-13:00
생명과환경|생활원예|2|서혜주|화 14:00-16:00
생명과환경|생활원예|2|서혜주|화 16:00-18:00
생명과환경|식량과인간|2|김태영 외 9명|목 16:00-18:00
생명과환경|자연과학의발달사|2|윤석주 외 1명|목 14:00-16:00
생명과환경|약과건강|2|이윤석|수 16:00-18:00
생명과환경|SDGs와자연|2|기서진 외 5명|월 16:00-18:00
과학과기술|실용수학|2|천은주|화 14:00-16:00
과학과기술|실용수학|2|공재훈|화 11:00-13:00
과학과기술|실용수학|2|공재훈|금 09:00-11:00
과학과기술|우주와지구|2|문용희|목 14:00-16:00
과학과기술|우주와지구|2|이상우|화 09:00-11:00
과학과기술|우주와지구|2|이상우|화 11:00-13:00
과학과기술|우주와지구|2|이상우|수 09:00-11:00
과학과기술|우주와지구|2|이상우|수 11:00-13:00
과학과기술|정보와통계|2|정연선|목 11:00-13:00
과학과기술|환경과오염|2|하광수|월 14:00-16:00
과학과기술|환경과오염|2|김둘선|화 09:00-11:00
과학과기술|환경과오염|2|김둘선|수 09:00-11:00
과학과기술|환경과오염|2|김둘선|월 14:00-16:00
과학과기술|환경과오염|2|김성철|금 11:00-13:00
과학과기술|특허의이해|2|이헌희|수 14:00-16:00
과학과기술|금융속의수|2|전두배|화 14:00-16:00
과학과기술|금융속의수|2|김예지|월 14:00-16:00
과학과기술|머신러닝소개및응용|2|김성현|화 22:00-24:00
과학과기술|인간과지구환경|2|미정|화 14:00-16:00
과학과기술|인간과지구환경|2|미정|화 16:00-18:00
과학과기술|인간과지구환경|2|미정|목 09:00-11:00
과학과기술|인간과지구환경|2|미정|목 11:00-13:00
과학과기술|에너지와탄소중립|2|이치우|수 11:00-13:00
과학과기술|4차산업혁명과과학기술|2|심갑식|화 16:00-18:00
과학과기술|디지털헬스리터러시|2|전광희|금 14:00-16:00
예술과체육|공연예술과문화|2|김겸섭|화 09:00-11:00
예술과체육|국악의이해|2|미정|화 14:00-16:00
예술과체육|디지털게임과문화|2|김겸섭|목 11:00-13:00
예술과체육|디지털사진찍기|2|유석규|금 14:00-16:00
예술과체육|레져스포츠(볼링,골프,스포츠클라이밍,스포츠댄스,방송댄스)|1|문성국|수 09:00-11:00
예술과체육|레져스포츠(볼링,골프,스포츠클라이밍,스포츠댄스,방송댄스)|1|문성국|수 11:00-13:00
예술과체육|레져스포츠(볼링,골프,스포츠클라이밍,스포츠댄스,방송댄스)|1|최강식|화 16:00-18:00
예술과체육|레져스포츠(볼링,골프,스포츠클라이밍,스포츠댄스,방송댄스)|1|신혜숙|목 11:00-13:00
예술과체육|레져스포츠(볼링,골프,스포츠클라이밍,스포츠댄스,방송댄스)|1|신혜숙|목 14:00-16:00
예술과체육|몸으로보는문화예술|2|남선희|월 11:00-13:00
예술과체육|문화예술교육개론|2|윤성원|화 09:00-11:00
예술과체육|발명과혁신을위한창의기법|2|정주영|목 16:00-18:00
예술과체육|수상스포츠(수영,카약,윈드서핑,수상스키,요트)|1|전형언|금 11:00-13:00
예술과체육|수상스포츠(수영,카약,윈드서핑,수상스키,요트)|1|오현정|화 11:00-13:00
예술과체육|수상스포츠(수영,카약,윈드서핑,수상스키,요트)|1|오현정|수 11:00-13:00
예술과체육|수상스포츠(수영,카약,윈드서핑,수상스키,요트)|1|오현정|목 11:00-13:00
예술과체육|영화의이해|2|홍상우|수 11:00-13:00
예술과체육|재미있는미술의세계|2|김혜영|목 09:00-11:00
예술과체육|축제와공연예술체험|2|박미|금 09:00-11:00
예술과체육|현대사회와스포츠|2|심윤|월 14:00-16:00
예술과체육|현대사회와스포츠|2|김현수|화 11:00-13:00
예술과체육|현대사회와스포츠|2|문성국|화 14:00-16:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|미정|수 16:00-18:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|하영욱|화 14:00-16:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|이동엽|수 14:00-16:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|신병익|목 16:00-18:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|신병익|목 14:00-16:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|정성헌|목 11:00-13:00
예술과체육|구기(축구,농구,배구,테니스,배드민턴,탁구)|1|손성원|금 16:00-18:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|이효선|월 09:00-11:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|조성아|수 14:00-16:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|박은지|월 14:00-16:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|박은지|화 14:00-16:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|이가람|월 14:00-16:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|문성국|수 14:00-16:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|최태호|화 18:00-20:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|강민정|화 09:00-11:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|미정|수 11:00-13:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|이언정|화 11:00-13:00
예술과체육|피트니스스포츠(요가,웨이트트레이닝,GX)|1|이언정|금 11:00-13:00
예술과체육|스포츠영화와윤리|2|심갑식|목 11:00-13:00
예술과체육|수학자가알려주는전염의원리|2|조선영|수 16:00-18:00
예술과체육|스포츠와ICT|2|심갑식|수 16:00-18:00
예술과체육|운동과건강|2|백경완|화 09:00-11:00
예술과체육|운동과건강|2|백경완|화 11:00-13:00
예술과체육|운동과건강|2|임창하|화 14:00-16:00
융·복합|꿈을비추는네개의거울|2|조대현 외 2명|월 16:00-18:00
융·복합|로봇과인문학|2|홍상우 외 1명|목 16:00-18:00
융·복합|예술과법|3|남궁술 외 2명|월 13:00-14:00, 수 16:00-18:00
진로와개척|공학과경영|2|차춘남|목 14:00-16:00
진로와개척|공학과경영|2|송지훈|화 14:00-16:00
진로와개척|공학윤리|2|박문정|월 14:00-16:00
진로와개척|공학윤리|2|박문정|월 16:00-18:00
진로와개척|공학윤리|2|박문정|화 14:00-16:00
진로와개척|공학윤리|2|박문정|화 16:00-18:00
진로와개척|독일어권취업및유학|2|강옥화|화 16:00-18:00
진로와개척|산업경영의이해|2|김원종|목 16:00-18:00
진로와개척|직장생활과법|2|최영진|화 14:00-16:00
진로와개척|창의적문제해결기법|2|오승환|월 14:00-16:00
진로와개척|창의적사고와문화콘텐츠산업|2|박미|수 16:00-18:00
진로와개척|진로탐색과로드맵|2|김신정|수 11:00-13:00
진로와개척|진로탐색과로드맵|2|김신정|수 14:00-16:00
진로와개척|진로탐색과로드맵|2|이윤주|목 14:00-16:00
진로와개척|진로설정과커리어개발|2|정성진|화 09:00-11:00
진로와개척|진로설정과커리어개발|2|정성진|화 11:00-13:00
진로와개척|소셜이노베이션창업|2|박상혁 외 2명|월 13:00-16:00
진로와개척|소셜이노베이션창업|2|박정선 외 1명|화 09:00-12:00
진로와개척|창업경영시뮬레이션|2|성상현 외 1명|수 11:00-13:00
진로와개척|기업가정신수도진주|2|박상혁 외 2명|월 11:00-13:00
진로와개척|기술창업기초|2|설병문|수 14:00-16:00
진로와개척|기술창업기초|2|윤상필|화 11:00-13:00
진로와개척|기술창업실무|2|이준엽|금 14:00-16:00
진로와개척|교양생활중국어|3|황산산|월 11:00-12:00, 목 09:00-11:00
진로와개척|교양생활중국어|3|손유경|화 09:00-11:00, 목 11:00-12:00
진로와개척|지역사회와봉사|1|염준호|금 11:00-13:00
진로와개척|지역사회와봉사|1|염준호|금 14:00-16:00
진로와개척|국제농업교류|2|심상인 외 1명|금 09:00-12:00
진로와개척|언어생활과규범|2|강민정|수 11:00-13:00
진로와개척|사물인터넷의이해와경험|2|강문혜|화 14:00-16:00
진로와개척|국제개발협력의이해|2|최기룡|금 11:00-13:00
진로와개척|ESG경영의이해|2|김영철 외 2명|수 16:00-18:00
진로와개척|농생명·바이오종합설계|2|허태웅|화 14:00-16:00
진로와개척|남명사상과K-기업가정신|2|방원석|목 11:00-13:00
진로와개척|빅데이터기반기업가정신과로컬창업|2|성상현 외 1명|수 09:00-11:00
진로와개척|기업가정신기록하기|2|윤상필|화 16:00-18:00
''';
